USE FitNetDB;

# підвищення витривалості

# вівторок дім
INSERT INTO `exercise` (`id`, `name`, `MET`, `type`, `training_day`, `image_link`, `number_of_repetitions`, `measurement`, `number_of_approaches`, `description`, `muscle_groups_trained`, `training_type_id`)
VALUES 
    (44, "Біг на вулиці", 8.0, "дім", "вівторок", "link_to_image1", 30, 'хв', 1, "Кардіо-вправа для підвищення витривалості та спалення калорій. Виконуйте біг на відстань або протягом встановленого часу.", "Кардіо", 3),
    (45, "Скакалка", 7.0, "дім", "вівторок", "link_to_image8", 25, "раз", 3, "Кардіо-вправа зі скакалкою для підвищення витривалості та спалення калорій. Візьміть скакалку в руки, підстрибуйте, обертаючи скакалку навколо себе та намагаючись робити кожен стрибок легким та плавним.", "ноги, руки", 3),
    (46, "Прес", 4.0, "дім", "вівторок", "link_to_image7", 15, "раз", 3, "Ляжте на спину, зігніть коліна, стопи на підлозі, руки позаду голови; Підніміть корпус, стискаючи черевні м'язи, доки плечі не відійдуть від підлоги; Повільно поверніться на початкову позицію, повторіть.", "брюшні", 3),
    (47, "Прес-папуга", 4.5, "дім", "вівторок", "link_to_image2", 15, "раз", 3, "Вправа для розвитку м'язів живота та зміцнення корпусу. Ляжте на підлогу, руки за головою. Підніміть тулуб та ноги, намагаючись доторкнутися ногами до рук.", "м'язи живота, корпус", 3),
    (48, "Скелолаз", 6.5, "дім", "вівторок", "link_to_image3", 1, "хв", 2, "Кардіо-вправа для підвищення витривалості та спалення калорій. Займіть положення планки на витягнутих руках, рівномірно розподіливши вагу між руками та пальцями ніг. Підтягніть праве коліно до грудей. Не послаблюючи контролю над мускулатурою корпусу, поверніть праву ногу назад і підтягніть до грудей ліву ногу.", "живіт, стегна, сідниці", 3),
    (49, "Присідання", 4.0, "дім", "вівторок", "link_to_image2", 15, "раз", 3, "Почніть стоячи з ногами на ширині плечей; Сідайте назад, якби сідали на стілець, доки стегна не стануть паралельними підлозі; Повільно поверніться на початкову позицію, повторіть.", "ноги", 3);

INSERT INTO `exercise_diseases` (`exercise_id`, `disease_id`)
VALUES
  (46, 3), -- Прес - проблеми з серцем
  (47, 3), -- Прес-папуга - проблеми з серцем
  (48, 1); -- Скелолаз - - астма

# вівторок спортзал
INSERT INTO `exercise` (`id`, `name`, `MET`, `type`, `training_day`, `image_link`, `number_of_repetitions`, `measurement`, `number_of_approaches`, `description`, `muscle_groups_trained`, `training_type_id`)
VALUES 
    (50, "Біг на біговій доріжці", 8.0, "спортзал", "вівторок", "link_to_image1", 10, "хв", 3, "Кардіо-вправа для покращення витривалості та збільшення кількості спалених калорій. Біжіть протягом встановленого часу.", "ноги, серце", 3),
    (51, "Велотренажер", 7.0, "спортзал", "вівторок", "link_to_image2", 10, "хв", 3, "Кардіо-вправа для покращення кровообігу та зміцнення нижніх кінцівок. Педалюйте протягом встановленого часу.", "ноги, серце", 3),
    (52, "Еліптичний тренажер", 6.0, "спортзал", "вівторок", "link_to_image5", 8, "хв", 2, "Кардіо-вправа для покращення кровообігу та збільшення витривалості. Вправа на еліптичному тренажері протягом встановленого часу.", "ноги, серце", 3),
    (53, "Присідання з гантелями", 5.0, "спортзал", "вівторок", "link_to_image5", 10, 'раз', 3, "Почніть стоячи з гантелями у руках на рівні плечей. Виконайте присідання, спускаючи сідниці назад і вниз, поки стегна не стануть паралельними підлозі. Повільно поверніться на початкову позицію, повторіть. Додавайте вагу на тренажер з кожним підходом.", "ноги, сідниці", 3),
    (54, "Боксерський мішок", 6.5, "спортзал", "вівторок", "link_to_image6", 15, 'хв', 1, "Кардіо-вправа для підвищення витривалості та розвитку силових характеристик. Вдаряйте у боксерський мішок протягом встановленого часу.", "Кардіо, руки", 3),
    (55, "Скручування", 4.0, "спортзал", "вівторок", "link_to_image3", 15, "раз", 3, "Вправа для розвитку м'язів живота. Сидячи на тренажері, згинаєтеся вперед і повертаєтеся в початкове положення.", "живіт", 3);

INSERT INTO `exercise_diseases` (`exercise_id`, `disease_id`)
VALUES
    (50, 3), -- Біг на біговій доріжці - проблеми з серцем
    (51, 1), -- Велотренажер - астма
    (53, 4), -- Присідання з гантелями - проблеми з суглобами
    (54, 4), -- Боксерський мішок - проблеми з суглобами
    (55, 3); -- Скручування - проблеми з серцем

# четвер дім
INSERT INTO `exercise` (`id`, `name`, `MET`, `type`, `training_day`, `image_link`, `number_of_repetitions`, `measurement`, `number_of_approaches`, `description`, `muscle_groups_trained`, `training_type_id`)
VALUES 
    (56, "Біг на місці", 7.0, "дім", "четвер", "link_to_image1", 1, "хв", 3, "Підвищення серцевого ритму, збільшення витрати калорій. Стійте на місці і піднімайте коліна вище, ніж талія поступово збільшуючи темп.", "ноги, ягодиці", 3),
    (57, "Скакалка", 7.0, "дім", "четвер", "link_to_image2", 25, "раз", 3, "Загальна витривалість, зменшення жиру. Стрибайте через скакалку, зберігаючи ритм.", "ноги, плечі, руки", 3),
    (58, "Планка", 4.0, "дім", "четвер", "link_to_image3", 1, "хв", 3, "Зміцнення кори, покращення стійкості. Ляжте на підлогу, опираючись на передпліччя та носки. Тримайте тіло в прямій лінії.", "спина, прес", 3),
    (59, "Берпі", 6.0, "дім", "четвер", "link_to_image4", 12, "раз", 3, "Загальна витривалість, збільшення сили. Виконайте присідання, потім відштовхнитесь від підлоги і зробить стрибок вгору.", "ноги, груди, плечі", 3),
    (60, "Скручування", 4.5, "дім", "четвер", "link_to_image5", 15, "раз", 3, "Зміцнення кора, покращення стійкості. Ляжте на спину, підніміть ноги і руки, і зведіть їх до центру.", "прес", 3),
    (61, "Динамічна планка", 5.0, "дім", "четвер", "link_to_image6", 1, "хв",  2, "Зміцнення кора, покращення стійкості. Почніть з планки, а потім чергувано піднімайте і опускай тіло на передпліччя та носки.", "спина, прес", 3);

INSERT INTO `exercise_diseases` (`exercise_id`, `disease_id`)
VALUES
    (56, 3), -- Біг на місці - проблеми з серцем
    (56, 1), -- Біг на місці - астма
    (57, 4), -- Скакалка - проблеми з суглобами
    (59, 3), -- Берпі - проблеми з серцем
    (59, 1), -- Берпі - астма
    (59, 4), -- Берпі - проблеми з суглобами
    (60, 3), -- Скручування - проблеми з серцем
    (61, 3); -- Динамічна планка - проблеми з серцем

# четвер спортзал
INSERT INTO `exercise` (`id`, `name`, `MET`, `type`, `training_day`, `image_link`, `number_of_repetitions`, `measurement`, `number_of_approaches`, `description`, `muscle_groups_trained`, `training_type_id`)
VALUES 
    (62, "Біг на біговій доріжці", 8.0, "спортзал", "четвер", "link_to_image1", 30, "хв", 1, "Кардіо-вправа для покращення витривалості та збільшення кількості спалених калорій. Біжіть протягом встановленого часу.", "ноги, серце", 3),
    (63, "Віджимання", 4.0, "спортзал", "четвер", "new_link_to_image10", 15, "раз", 3, "Ляжте на підлогу, розмістіть руки на плечах, опустіть тіло до того часу, поки ваші лікті не стануть вигнутими під кутом 90 градусів, а потім підніміться назад.", "груди, плечі, трицепс", 3),
    (64, "Скручування", 4.0, "спортзал", "четвер", "link_to_image3", 15, "раз", 3, "Вправа для розвитку м'язів живота. Сидячи на тренажері, згинаєтеся вперед і повертаєтеся в початкове положення.", "живіт", 3),
    (65, "Присідання", 4.0, "спортзал", "четвер", "link_to_image2", 15, "раз", 3, "Почніть стоячи з ногами на ширині плечей; Сідайте назад, якби сідали на стілець, доки стегна не стануть паралельними підлозі; Повільно поверніться на початкову позицію, повторіть.", "ніжні м'язи", 3),
    (66, "Бруси", 5.0, "спортзал", "четвер", "link_to_image5", 10, "раз", 3, "Вправа для зміцнення м'язів корпусу та рук. Поставте руки на підлогу на ширині плечей, станьте на носки. Схиляйтеся, спускаючи тіло, потім повертайтеся в початкове положення.", "корпус, руки", 3),
    (67, "Підтягування", 5.0, "спортзал", "четвер", "link_to_image6", 10, "раз", 3, "Загальна витривалість та сила верхньої частини тіла. Виконуйте підтягування на турніке або спеціальному тренажері", "спина, біцепс", 3);

INSERT INTO `exercise_diseases` (`exercise_id`, `disease_id`)
VALUES
  (62, 3), -- Біг на біговій доріжці - проблеми з серцем
  (64, 3), -- Скручування - проблеми з серцем
  (67, 4); -- Підтягування - проблема з суглобами

# субота дім
INSERT INTO `exercise` (`id`, `name`, `MET`, `type`, `training_day`, `image_link`, `number_of_repetitions`, `measurement`, `number_of_approaches`, `description`, `muscle_groups_trained`, `training_type_id`)
VALUES 
    (68, "Біг на вулиці", 8.0, "дім", "субота", "link_to_image1", 30, 'хв', 1, "Кардіо-вправа для підвищення витривалості та спалення калорій. Виконуйте біг на відстань або протягом встановленого часу.", "Кардіо", 3),
    (69, "Скручування", 4.5, "дім", "субота", "link_to_image5", 15, "раз", 3, "Зміцнення кора, покращення стійкості. Ляжте на спину, підніміть ноги і руки, і зведіть їх до центру.", "прес", 3),
    (70, "Берпі", 6.0, "дім", "субота", "link_to_image4", 12, "раз", 3, "Загальна витривалість, збільшення сили. Виконайте присідання, потім відштовхнитесь від підлоги і зробить стрибок вгору.", "ноги, груди, плечі", 3),
    (71, "Планка", 4.0, "дім", "субота", "link_to_image3", 1, "хв", 3, "Зміцнення кори, покращення стійкості. Ляжте на підлогу, опираючись на передпліччя та носки. Тримайте тіло в прямій лінії.", "спина, прес", 3),
    (72, "Скакалка", 7.0, "дім", "субота", "link_to_image2", 25, "раз", 3, "Загальна витривалість, зменшення жиру. Стрибайте через скакалку, зберігаючи ритм.", "ноги, плечі, руки", 3),
    (73, "Присідання", 4.0, "дім", "субота", "link_to_image2", 15, "раз", 3, "Почніть стоячи з ногами на ширині плечей; Сідайте назад, якби сідали на стілець, доки стегна не стануть паралельними підлозі; Повільно поверніться на початкову позицію, повторіть.", "ніжні м'язи", 3);

INSERT INTO `exercise_diseases` (`exercise_id`, `disease_id`)
VALUES
	(69, 3), -- Скручування - проблеми з серцем
	(70, 3), -- Берпі - проблеми з серцем
    (70, 1), -- Берпі - астма
    (70, 4), -- Берпі - проблеми з суглобами
    (71, 3), -- Планка - проблеми з серцем
    (72, 3); -- Скакалка - проблеми з серцем

# субота спортзал
INSERT INTO `exercise` (`id`, `name`, `MET`, `type`, `training_day`, `image_link`, `number_of_repetitions`, `measurement`, `number_of_approaches`, `description`, `muscle_groups_trained`, `training_type_id`)
VALUES 
    (74, "Велотренажер", 7.0, "спортзал", "субота", "link_to_image2", 10, "хв", 3, "Кардіо-вправа для покращення кровообігу та зміцнення нижніх кінцівок. Педалюйте протягом встановленого часу.", "ноги, серце", 3),
    (75, "Скакалка", 7.0, "спортзал", "субота", "link_to_image8", 25, "раз", 3, "Кардіо-вправа зі скакалкою для підвищення витривалості та спалення калорій. Візьміть скакалку в руки, підстрибуйте, обертаючи скакалку навколо себе та намагаючись робити кожен стрибок легким та плавним.", "ноги, руки", 3),
    (76, "Берпі", 6.0, "спортзал", "субота", "link_to_image4", 12, "раз", 3, "Загальна витривалість, збільшення сили. Виконайте присідання, потім відштовхнитесь від підлоги і зробить стрибок вгору.", "ноги, груди, плечі", 3),
    (77, "Прес", 4.0, "спортзал", "субота", "link_to_image7", 15, "раз", 3, "Ляжте на спину, зігніть коліна, стопи на підлозі, руки позаду голови; Підніміть корпус, стискаючи черевні м'язи, доки плечі не відійдуть від підлоги; Повільно поверніться на початкову позицію, повторіть.", "брюшні", 3),
    (78, "Підтягування", 5.0, "спортзал", "субота", "link_to_image6", 10, "раз", 3, "Загальна витривалість та сила верхньої частини тіла. Виконуйте підтягування на турніке або спеціальному тренажері", "спина, біцепс", 3),
    (79, "Віджимання", 4.0, "спортзал", "субота", "new_link_to_image10", 15, "раз", 3, "Ляжте на підлогу, розмістіть руки на плечах, опустіть тіло до того часу, поки ваші лікті не стануть вигнутими під кутом 90 градусів, а потім підніміться назад.", "груди, плечі, трицепс", 3);

INSERT INTO `exercise_diseases` (`exercise_id`, `disease_id`)
VALUES
    (74, 1), -- Велотренажер - астма
    (76, 3), -- Берпі - проблеми з серцем
    (76, 1), -- Берпі - астма
    (76, 4), -- Берпі - проблеми з суглобами
	(68, 4); -- Підтягування - проблема з суглобами