USE FitNetDB;

# схуднення

# понеділок дім
INSERT INTO `exercise` (`id`, `name`, `MET`, `type`, `training_day`, `image_link`, `number_of_repetitions`, `measurement`, `number_of_approaches`, `description`, `muscle_groups_trained`, `training_type_id`)
VALUES 
    (80, "Присідання", 4.0, "дім", "понеділок", "link_to_image1", 15, 'раз', 3, "Станьте прямо з ногами на ширині плечей. Присідайте, відводячи стегна назад і тримаючи спину прямою. Повертайтеся до початкової позиції.", "квадрицепси, сідничні м’язи", 2),
    (81, "Віджимання", 4.0, "дім", "понеділок", "link_to_image2", 12, 'раз', 3, "Ляжте обличчям вниз, руки на ширині плечей. Віджимайтеся, піднімаючи тіло, а потім повільно опускайтеся назад.", "грудні м’язи, трицепси, передня дельта", 2),
    (82, "Підйоми ніг", 3.5, "дім", "понеділок", "link_to_image3", 15, 'раз', 3, "Ляжте на спину, руки вздовж тіла. Піднімайте прямі ноги вгору, а потім повільно опускайте їх не торкаючись підлоги.", "прес", 2),
    (83, "Берпі", 6.0, "дім", "понеділок", "link_to_image4", 10, 'раз', 3, "Почніть у стоячій позиції, потім присядьте, руки на підлогу. Вистрибніть ногами назад у планку, потім поверніться в присід і стрибніть вгору.", "ноги, груди, плечі", 2),
    (84, "Випади", 2.8, "дім", "понеділок", "link_to_image5", 12, 'раз', 3, "Станьте прямо, робіть крок вперед однією ногою і опускайтеся до того, як задня коліно майже торкнеться підлоги. Повертайтеся і повторіть на іншу ногу.", "квадрицепси, сідничні м’язи", 2);

INSERT INTO `exercise_diseases` (`exercise_id`, `disease_id`)
VALUES
    (80, 1), -- Присідання - астма
    (81, 3), -- Віджимання - проблеми з серцем
    (82, 4), -- Підйоми ніг - проблеми з суглобами
    (83, 3), -- Берпі - проблеми з серцем
    (83, 1), -- Берпі - астма
    (84, 4); -- Випади - проблеми з суглобами

# понеділок спортзал
INSERT INTO `exercise` (`id`, `name`, `MET`, `type`, `training_day`, `image_link`, `number_of_repetitions`, `measurement`, `number_of_approaches`, `description`, `muscle_groups_trained`, `training_type_id`)
VALUES 
    (85, "Тяга гантелей у нахилі", 6.0, "спортзал", "понеділок", "link_to_image6", 12, 'раз', 3, "Нахиліться, тримаючи гантелі в руках. Піднімайте гантелі до боків тулуба, стискаючи лопатки. Додавайте вагу на тренажер з кожним підходом.", "верх спини, задня дельта", 2),
    (86, "Станова тяга", 6.0, "спортзал", "понеділок", "link_to_image7", 10, 'раз', 3, "Станьте прямо, ноги на ширині плечей. Нахиліться, тримаючи штангу, і підніміть її, тримаючи спину прямою. Додавайте вагу на тренажер з кожним підходом.", "спина, стегна, сідничні м’язи", 2),
    (87, "Жим ногами", 5.0, "спортзал", "понеділок", "link_to_image8", 15, 'раз', 3, "Ляжте на тренажер і встановіть ноги на платформу. Відтисніть платформу від себе, а потім повільно опустіть назад. Додавайте вагу на тренажер з кожним підходом.", "квадрицепси, сідничні м’язи", 2),
    (88, "Жим штанги лежачи", 3.5, "спортзал", "понеділок", "link_to_image9", 12, 'раз', 3, "Ляжте на лавку, візьміть штангу широким хватом. Опустіть штангу до грудей, а потім відтисніть назад. Додавайте вагу на тренажер з кожним підходом.", "грудні м’язи, трицепси", 2),
    (89, "Підйоми на біцепс", 4.0, "спортзал", "понеділок", "link_to_image10", 15, 'раз', 3, "Станьте прямо, тримаючи гантелі. Піднімайте гантелі до плечей, згинаючи лікті. Додавайте вагу на тренажер з кожним підходом.", "біцепси", 2),
    (90, "Велосипед", 7.0, "спортзал", "понеділок", "link_to_image11", 15, 'раз', 3, "Ляжте на спину, руки за головою. Піднімайте коліна до грудей, імітуючи крутіння педалей.", "прес, стегна", 2);

INSERT INTO `exercise_diseases` (`exercise_id`, `disease_id`)
VALUES
    (85, 3), -- Тяга гантелей у нахилі - проблеми з серцем
    (86, 4), -- Станова тяга - проблеми з суглобами
    (87, 4), -- Жим ногами - проблеми з суглобами
    (88, 4), -- Жим штанги лежачи - проблеми з суглобами
    (89, 3), -- Підйоми на біцепс - проблеми з серцем
    (90, 3); -- Велосипед - проблеми з серцем

# середа дім
INSERT INTO `exercise` (`id`, `name`, `MET`, `type`, `training_day`, `image_link`, `number_of_repetitions`, `measurement`, `number_of_approaches`, `description`, `muscle_groups_trained`, `training_type_id`)
VALUES 
    (91, "Біг на місці", 6.0, "дім", "середа", "link_to_image12", 15, 'раз', 3, "Біжіть на місці з підняттям колін якомога вище.", "квадрицепси, сідничні м’язи, ікри", 2),
    (92, "Віджимання", 4.0, "дім", "середа", "link_to_image13", 15, 'раз', 3, "Ляжте обличчям вниз, руки на ширині плечей. Віджимайтеся, піднімаючи тіло, а потім повільно опускайтеся назад.", "грудні м’язи, трицепси, передня дельта", 2),
    (93, "Присідання зі стрибком", 6.0, "дім", "середа", "link_to_image14", 15, 'раз', 3, "Виконуйте присідання, а потім різко стрибайте вгору, піднімаючи руки.", "квадрицепси, сідничні м’язи, ікри", 2),
    (94, "Планка з торканням плеча", 5.0, "дім", "середа", "link_to_image15", 1, 'хв', 3, "Утримуйте планку на прямих руках, чергово торкаючись протилежного плеча.", "прес, спина, плечі", 2),
    (95, "Бічні випади", 5.0, "дім", "середа", "link_to_image16", 12, 'раз', 3, "Станьте прямо, робіть великий крок в сторону, присідаючи на одну ногу, інша нога пряма. Повертайтеся в початкове положення і повторіть на іншу сторону.", "квадрицепси, сідничні м’язи", 2),
    (96, "Підйоми тазу лежачи", 4.0, "дім", "середа", "link_to_image17", 15, 'раз', 3, "Ляжте на спину, ноги зігнуті в колінах, піднімайте таз, стискаючи сідничні м’язи.", "сідничні м’язи, задня частина стегон", 2);

INSERT INTO `exercise_diseases` (`exercise_id`, `disease_id`)
VALUES
    (91, 3), -- Біг на місці - проблеми з серцем
    (93, 3), -- Присідання зі стрибком - проблеми з серцем
    (93, 4), -- Присідання зі стрибком - проблеми з суглобами
    (95, 4), -- Бічні випади - проблеми з суглобами
    (96, 4); -- Підйоми тазу лежачи - проблеми з суглобами

# середа спортзал
INSERT INTO `exercise` (`id`, `name`, `MET`, `type`, `training_day`, `image_link`, `number_of_repetitions`, `measurement`, `number_of_approaches`, `description`, `muscle_groups_trained`, `training_type_id`)
VALUES 
    (97, "Бігова доріжка", 8.0, "спортзал", "середа", "link_to_image18", 1, 'хв', 1, "30 хвилин бігу зі змінною швидкістю.", "серцево-судинна система, ноги", 2),
    (98, "Жим гантелей лежачи", 6.0, "спортзал", "середа", "link_to_image19", 12, 'раз', 3, "Лежачи на лавці, піднімайте гантелі від грудей і опускайте назад. Додавайте вагу на тренажер з кожним підходом.", "грудні м’язи, трицепси", 2),
    (99, "Тяга штанги в нахилі", 5.0, "спортзал", "середа", "link_to_image20", 10, 'раз', 3, "Нахиліться, тримаючи штангу, тягніть її до живота, тримаючи спину прямою. Додавайте вагу на тренажер з кожним підходом.", "широчезні м’язи спини, біцепси", 2),
    (100, "Присідання зі штангою", 6.0, "спортзал", "середа", "link_to_image21", 15, 'раз', 3, "Тримаючи штангу на плечах, виконуйте присідання, тримаючи спину прямою. Додавайте вагу на тренажер з кожним підходом.", "квадрицепси, сідничні м’язи, задня частина стегон", 2),
    (101, "Віджимання на брусах", 5.0, "спортзал", "середа", "link_to_image22", 10, 'раз', 3, "Віджимайтеся на брусах, опускаючи тіло вниз, а потім піднімаючи назад.", "трицепси, передня дельта", 2),
    (102, "Планка", 4.0, "спортзал", "середа", "link_to_image23", 1, 'хв', 3, "Утримуйте планку на передпліччях та носках, тримаючи тіло прямим.", "прес, спина", 2);

INSERT INTO `exercise_diseases` (`exercise_id`, `disease_id`)
VALUES
    (97, 3), -- Бігова доріжка - проблеми з серцем
    (98, 3), -- Вільні ваги - жим гантелей лежачи - проблеми з серцем
    (98, 4), -- Вільні ваги - жим гантелей лежачи - проблеми з суглобами
    (99, 4), -- Тяга штанги в нахилі - проблеми з суглобами
    (100, 4), -- Присідання зі штангою - проблеми з суглобами
    (101, 4), -- Віджимання на брусах - проблеми з суглобами
    (102, 3); -- Планка - проблеми з серцем

# п’ятниця дім
INSERT INTO `exercise` (`id`, `name`, `MET`, `type`, `training_day`, `image_link`, `number_of_repetitions`, `measurement`, `number_of_approaches`, `description`, `muscle_groups_trained`, `training_type_id`)
VALUES 
    (103, "Присідання", 5.0, "дім", "неділя", "link_to_image24", 15, 'раз', 3, "Станьте прямо з ногами на ширині плечей, присідайте, тримаючи спину прямою, а коліна не виходять за лінію пальців ніг.", "квадрицепси, сідничні м’язи, гомілковостоп", 2),
    (104, "Віджимання", 4.0, "дім", "неділя", "link_to_image25", 12, 'раз', 3, "Ляжте обличчям вниз, руки на ширині плечей, віджимайтеся, згинаючи лікті до 90 градусів.", "грудні м’язи, трицепси, передня дельта", 2),
    (105, "Планка", 3.0, "дім", "неділя", "link_to_image26", 1, 'хв', 3, "Ляжте на живіт, підніміть тіло на передпліччях і носках, тримайте пряму лінію від голови до п’ят.", "прес, спина, плечі", 2),
    (106, "Випади", 2.5, "дім", "неділя", "link_to_image27", 10, 'раз', 3, "Станьте прямо, робіть крок вперед однією ногою і опускайтеся до того, як задня коліно майже торкнеться підлоги.", "квадрицепси, сідничні м’язи, гомілковостоп", 2),
    (107, "Біг на місці", 6.0, "дім", "неділя", "link_to_image28", 1, 'хв', 3, "Бігайте на місці, піднімаючи коліна високо і швидко.", "квадрицепси, сідничні м’язи, серцево-судинна система", 2),
    (108, "Підйоми тулуба", 3.5, "дім", "неділя", "link_to_image29", 15, 'раз', 3, "Ляжте на спину, зігніть коліна, руки за головою, піднімайте верхню частину тіла до колін.", "прес", 2);

INSERT INTO `exercise_diseases` (`exercise_id`, `disease_id`)
VALUES
    (103, 4), -- Присідання - проблеми з суглобами
    (105, 3), -- Планка - проблеми з серцем
    (107, 1), -- Біг на місці - астма
    (107, 3); -- Біг на місці - проблеми з серцем

# п’ятниця спортзал
INSERT INTO `exercise` (`id`, `name`, `MET`, `type`, `training_day`, `image_link`, `number_of_repetitions`, `measurement`, `number_of_approaches`, `description`, `muscle_groups_trained`, `training_type_id`)
VALUES 
    (109, "Тяга гантелей у нахилі", 6.0, "спортзал", "неділя", "link_to_image30", 12, 'раз', 3, "Нахиліться, тримаючи спину прямою, і тягніть гантелі до боків тулуба. Додавайте вагу на тренажер з кожним підходом.", "спина, біцепси", 2),
    (110, "Жим штанги лежачи", 6.0, "спортзал", "неділя", "link_to_image31", 10, 'раз', 3, "Ляжте на лавку, тримайте штангу на ширині плечей і жміть її вгору до повного випрямлення рук. Додавайте вагу на тренажер з кожним підходом.", "грудні м’язи, трицепси", 2),
    (111, "Присідання зі штангою", 6.0, "спортзал", "неділя", "link_to_image32", 15, 'раз', 3, "Тримайте штангу на плечах, присідайте, тримаючи спину прямою. Додавайте вагу на тренажер з кожним підходом.", "квадрицепси, сідничні м’язи", 2),
    (112, "Станова тяга", 6.0, "спортзал", "неділя", "link_to_image33", 12, 'раз', 3, "Станьте прямо, нахиліться, тримаючи штангу, і підніміть її, тримаючи спину прямою. Додавайте вагу на тренажер з кожним підходом.", "спина, стегна, сідничні м’язи", 2),
    (113, "Бруса", 5.0, "спортзал", "неділя", "link_to_image34", 10, 'раз', 3, "Віджимайтеся на брусах, згинаючи руки до кута 90 градусів.", "трицепси, грудні м’язи", 2),
    (114, "Підйом ніг у висі", 3.5, "спортзал", "неділя", "link_to_image35", 15, 'раз', 3, "Повісьте на турніку і піднімайте прямі ноги до горизонтального положення.", "прес, стегна", 2);

INSERT INTO `exercise_diseases` (`exercise_id`, `disease_id`)
VALUES
    (109, 4), -- Тяга гантелей у нахилі - проблеми з суглобами
    (110, 3), -- Жим штанги лежачи - проблеми з серцем
    (111, 4), -- Присідання зі штангою - проблеми з суглобами
    (112, 4); -- Станова тяга - проблеми з суглобами