USE FitNetDB;

# підвищення м’язової маси

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(109, 1, 'Омлет 3 яйця', 100, 'г', 'сніданок', 'понеділок', 131, 12.35, 8.36, 0.54, 'link_to_image'),
(110, 1, 'Хліб цільнозерновий', 100, 'г', 'сніданок', 'понеділок', 237, 13, 3.3, 41, 'link_to_image'),
(111, 1, 'Вівсяне печиво', 100, 'г', 'сніданок', 'понеділок', 450, 5.51, 18, 69, 'link_to_image'),
(112, 1, 'Банан', 100, 'г', 'сніданок', 'понеділок', 94, 1.2, 0.2, 22, 'link_to_image'),
(113, 1, 'Зелений чай без цукру', 250, 'мл', 'сніданок', 'понеділок', 1, 0, 0, 0.25, 'link_to_image'),
(114, 1, 'Риба хек тушкована з морквою', 100, 'г', 'обід', 'понеділок', 87, 6.8, 5.2, 3.7, 'link_to_image'),
(115, 1, 'Рис з овочами', 100, 'г', 'обід', 'понеділок', 99, 1.6, 3.8, 15.1, 'link_to_image'),
(116, 1, 'Яблуко червоне', 100, 'г', 'обід', 'понеділок', 73, 0.4, 1.7, 15, 'link_to_image'),
(117, 1, 'Зелений чай без цукру', 250, 'мл', 'обід', 'понеділок', 1, 0, 0, 0.25, 'link_to_image'),
(118, 1, 'Стейк з яловичини', 100, 'г', 'вечеря', 'понеділок', 164, 23, 8, 0, 'link_to_image'),
(119, 1, 'Картопля запечена з олією', 100, 'г', 'вечеря', 'понеділок', 185, 2.8, 9.5, 23.4, 'link_to_image'),
(120, 1, 'Тушковані овочі', 100, 'г', 'вечеря', 'понеділок', 33, 1.3, 0.1, 5.6, 'link_to_image'),
(121, 1, 'Зелений чай без цукру', 250, 'мл', 'вечеря', 'понеділок', 1, 0, 0, 0.25, 'link_to_image');

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(122, 1, 'Бананові млинці з медом', 100, 'г', 'сніданок', 'вівторок', 231, 4.2, 8.1, 35.6, 'link_to_image'),
(123, 1, 'Ягідна суміш', 100, 'г', 'сніданок', 'вівторок', 45, 1, 0.3, 6.4, 'link_to_image'),
(124, 1, 'Сік апельсиновий', 250, 'мл', 'сніданок', 'вівторок', 128, 1.75, 0, 30, 'link_to_image'),
(125, 1, 'Куряче філе запечене', 100, 'г', 'обід', 'вівторок', 165, 30, 3.5, 0, 'link_to_image'),
(126, 1, 'Картопля запечена з олією', 100, 'г', 'обід', 'вівторок', 185, 2.8, 9.5, 23.4, 'link_to_image'),
(127, 1, 'Яблуко червоне', 100, 'г', 'обід', 'вівторок', 73, 0.4, 1.7, 15, 'link_to_image'),
(128, 1, 'Йогурт 2.2% ягідний', 250, 'мл', 'обід', 'вівторок', 210, 7, 5.5, 32.5, 'link_to_image'),
(129, 1, 'Лазанья з фаршем', 100, 'г', 'вечеря', 'вівторок', 205, 10, 11, 17.17, 'link_to_image'),
(130, 1, 'Хліб цільнозерновий', 100, 'г', 'вечеря', 'вівторок', 237, 13, 3.3, 41, 'link_to_image'),
(131, 1, 'Салат з яйцем і плавленим сиром', 100, 'г', 'вечеря', 'вівторок', 355, 17, 31.1, 1.6, 'link_to_image'),
(132, 1, 'Зелений чай без цукру', 250, 'мл', 'вечеря', 'вівторок', 1, 0, 0, 0.25, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (122, 2), -- діабет
    (123, 2), -- діабет
    (124, 2), -- діабет
    (128, 2), -- діабет
    (129, 2); -- діабет

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(133, 1, 'Вівсяна каша з молоком 2.5%', 100, 'г', 'сніданок', 'середа', 95, 3.7, 2.9, 14.2, 'link_to_image'),
(134, 1, 'Ананас свіжий', 100, 'г', 'сніданок', 'середа', 58, 0.49, 0.19, 12.7, 'link_to_image'),
(135, 1, 'Зелений чай без цукру', 250, 'мл', 'сніданок', 'середа', 1, 0, 0, 0.25, 'link_to_image'),
(136, 1, 'Салат з тунцем, овочами та яйцем', 100, 'г', 'обід', 'середа', 107, 6.91, 0.19, 7.7, 'link_to_image'),
(137, 1, 'Салат з огірків помідорів і сметаною', 100, 'г', 'обід', 'середа', 50, 1, 3, 3, 'link_to_image'),
(138, 1, 'Хліб цільнозерновий', 100, 'г', 'обід', 'середа', 237, 13, 3.3, 41, 'link_to_image'),
(139, 1, 'Яблуко червоне', 100, 'г', 'обід', 'середа', 73, 0.4, 1.7, 15, 'link_to_image'),
(140, 1, 'Зелений чай без цукру', 250, 'мл', 'обід', 'середа', 1, 0, 0, 0.25, 'link_to_image'),
(141, 1, 'Куряче філе смажене', 100, 'г', 'вечеря', 'середа', 179, 29, 7, 0.6, 'link_to_image'),
(142, 1, 'Тушковані овочі', 100, 'г', 'вечеря', 'середа', 33, 1.3, 0.1, 5.6, 'link_to_image'),
(143, 1, 'Картопляне пюре', 100, 'г', 'вечеря', 'середа', 115, 2.7, 2.75, 19.47, 'link_to_image'),
(144, 1, 'Груша', 100, 'г', 'вечеря', 'середа', 58, 0.44, 0.33, 13.42, 'link_to_image'),
(145, 1, 'Зелений чай без цукру', 250, 'мл', 'вечеря', 'середа', 1, 0, 0, 0.25, 'link_to_image');

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(146, 1, 'Омлет 3 яйця', 100, 'г', 'сніданок', 'четвер', 131, 12.35, 8.36, 0.54, 'link_to_image'),
(147, 1, 'Хліб цільнозерновий', 100, 'г', 'сніданок', 'четвер', 237, 13, 3.3, 41, 'link_to_image'),
(148, 1, 'Яблуко червоне', 100, 'г', 'сніданок', 'четвер', 73, 0.4, 1.7, 15, 'link_to_image'),
(149, 1, 'Зелений чай без цукру', 250, 'мл', 'сніданок', 'четвер', 1, 0, 0, 0.25, 'link_to_image'),
(150, 1, 'Булгур', 100, 'г', 'обід', 'четвер', 97, 3.08, 0.24, 18.58, 'link_to_image'),
(151, 1, 'Тушкована телятина', 100, 'г', 'обід', 'четвер', 179, 25, 7, 0, 'link_to_image'),
(152, 1, 'Салат з рукколи з моцарелою та в’яленими томатами', 100, 'г', 'обід', 'четвер', 236, 8.62, 19.1, 7.56, 'link_to_image'),
(153, 1, 'Сік апельсиновий', 250, 'мл', 'обід', 'четвер', 128, 1.75, 0, 30, 'link_to_image'),
(154, 1, 'Котлета куряча парова', 100, 'г', 'вечеря', 'четвер', 135, 21.5, 2, 4, 'link_to_image'),
(155, 1, 'Овочі на пару', 100, 'г', 'вечеря', 'четвер', 29, 2.1, 0.2, 4, 'link_to_image'),
(156, 1, 'Суп овочевий', 100, 'г', 'вечеря', 'четвер', 37, 1.7, 1.6, 4.2, 'link_to_image'),
(157, 1, 'Зелений чай без цукру', 250, 'мл', 'вечеря', 'четвер', 1, 0, 0, 0.25, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (153, 2); -- діабет

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(158, 1, 'Вівсяна каша з молоком 2.5%', 100, 'г', 'сніданок', 'п’ятниця', 95, 3.7, 2.9, 14.2, 'link_to_image'),
(159, 1, 'Протеїновий коктель', 100, 'г', 'сніданок', 'п’ятниця', 385, 83, 4.3, 3.7, 'link_to_image'),
(160, 1, 'Зелений чай без цукру', 250, 'мл', 'сніданок', 'п’ятниця', 1, 0, 0, 0.25, 'link_to_image'),
(161, 1, 'Стейк з яловичини', 100, 'г', 'обід', 'п’ятниця', 164, 23, 8, 0, 'link_to_image'),
(162, 1, 'Рис з овочами', 100, 'г', 'обід', 'п’ятниця', 99, 1.6, 3.8, 15.1, 'link_to_image'),
(163, 1, 'Салат з яйцями і морквою', 100, 'г', 'обід', 'п’ятниця', 107, 8, 7, 5, 'link_to_image'),
(164, 1, 'Сік з грейпфрута', 100, 'г', 'обід', 'п’ятниця', 42, 0.7, 0, 8.8, 'link_to_image'),
(165, 1, 'Курячий стейк', 100, 'г', 'вечеря', 'п’ятниця', 191, 24, 9, 9, 'link_to_image'),
(166, 1, 'Овочі на пару', 100, 'г', 'вечеря', 'п’ятниця', 29, 2.1, 0.2, 4, 'link_to_image'),
(167, 1, 'Суп овочевий', 100, 'г', 'вечеря', 'п’ятниця', 37, 1.7, 1.6, 4.2, 'link_to_image'),
(168, 1, 'Зелений чай без цукру', 250, 'мл', 'вечеря', 'п’ятниця', 1, 0, 0, 0.25, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (162, 2), -- діабет
    (164, 2); -- діабет

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(169, 1, 'Яєчня з сиром', 100, 'г', 'сніданок', 'субота', 215, 14.8, 16, 1.6, 'link_to_image'),
(170, 1, 'Груша', 100, 'г', 'сніданок', 'субота', 58, 0.44, 0.33, 13.42, 'link_to_image'),
(171, 1, 'Яблучний сік', 250, 'мл', 'сніданок', 'субота', 114, 2.75, 0.25, 25, 'link_to_image'),
(172, 1, 'М’ясний рагу з картоплею', 100, 'г', 'обід', 'субота', 119, 4.03, 7.03, 10.77, 'link_to_image'),
(173, 1, 'Салат з огірків помідорів і сметаною', 100, 'г', 'обід', 'субота', 50, 1, 3, 3, 'link_to_image'),
(174, 1, 'Яблучний сік', 250, 'мл', 'обід', 'субота', 114, 2.75, 0.25, 25, 'link_to_image'),
(175, 1, 'Котлета куряча парова', 100, 'г', 'вечеря', 'субота', 135, 21.5, 2, 4, 'link_to_image'),
(176, 1, 'Овочі на пару', 100, 'г', 'вечеря', 'субота', 29, 2.1, 0.2, 4, 'link_to_image'),
(177, 1, 'Суп овочевий', 100, 'г', 'вечеря', 'субота', 37, 1.7, 1.6, 4.2, 'link_to_image'),
(178, 1, 'Зелений чай без цукру', 250, 'мл', 'вечеря', 'субота', 1, 0, 0, 0.25, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (171, 2), -- діабет
    (174, 2); -- діабет

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(179, 1, 'Омлет 3 яйця', 100, 'г', 'сніданок', 'неділя', 131, 12.35, 8.36, 0.54, 'link_to_image'),
(180, 1, 'Хліб цільнозерновий', 100, 'г', 'сніданок', 'неділя', 237, 13, 3.3, 41, 'link_to_image'),
(181, 1, 'Йогурт 2.2% ягідний', 250, 'мл', 'сніданок', 'неділя', 210, 7, 5.5, 32.5, 'link_to_image'),
(182, 1, 'М’ясна лазанья з сиром', 100, 'г', 'обід', 'неділя', 226, 10.9, 7.2, 31.4, 'link_to_image'),
(183, 1, 'Салат з кильки в томатному соусі', 100, 'г', 'обід', 'неділя', 283, 5, 27.2, 5, 'link_to_image'),
(184, 1, 'Сік апельсиновий', 250, 'мл', 'обід', 'неділя', 128, 1.75, 0, 30, 'link_to_image'),
(185, 1, 'Гуляш з яловичини', 100, 'г', 'вечеря', 'неділя', 148, 14, 9.2, 2.6, 'link_to_image'),
(186, 1, 'Картопля запечена з олією', 100, 'г', 'вечеря', 'неділя', 185, 2.8, 9.5, 23.4, 'link_to_image'),
(187, 1, 'Салат овочевий заправлений олією', 100, 'г', 'вечеря', 'неділя', 57, 2, 3, 6, 'link_to_image'),
(188, 1, 'Зелений чай без цукру', 250, 'мл', 'вечеря', 'неділя', 1, 0, 0, 0.25, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (181, 2), -- діабет
    (182, 2), -- діабет
    (184, 2), -- діабет
    (186, 2); -- діабет