USE FitNetDB;

# покращення здоров`я та фізичної форми

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(1, 4, 'Вівсяна каша', 100, 'г', 'сніданок', 'понеділок', 88, 3, 0, 17, 'link_to_image'),
(2, 4, 'Яблуко червоне', 100, 'г', 'сніданок', 'понеділок', 73, 0.4, 1.7, 15, 'link_to_image'),
(3, 4, 'Банан', 100, 'г', 'сніданок', 'понеділок', 94, 1.2, 0.2, 22, 'link_to_image'),
(4, 4, 'Зелений чай без цукру', 250, 'мл', 'сніданок', 'понеділок', 1, 0, 0, 0.25, 'link_to_image'),
(5, 4, 'Овочевий суп з куркою', 100, 'г', 'обід', 'понеділок', 35, 3.11, 1.12, 3.71, 'link_to_image'),
(6, 4, 'Зелений чай без цукру', 250, 'мл', 'обід', 'понеділок', 1, 0, 0, 0.25, 'link_to_image'),
(7, 4, 'Овочі на пару', 100, 'г', 'вечеря', 'понеділок', 29, 2.1, 0.2, 4, 'link_to_image'),
(8, 4, 'Яловичина відварна нежирна', 100, 'г', 'вечеря', 'понеділок', 175, 25.7, 8.1, 0.2, 'link_to_image'),
(9, 4, 'Зелений чай із імбиром без цукру', 250, 'мл', 'вечеря', 'понеділок', 3, 0, 0, 0.3, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (2, 2), -- діабет
    (3, 2); -- діабет

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(10, 4, 'Сирники смажені', 100, 'г', 'сніданок', 'вівторок', 202, 12.55, 9, 17.83, 'link_to_image'),
(11, 4, 'Зелений чай без цукру', 250, 'мл', 'сніданок', 'вівторок', 1, 0, 0, 0.25, 'link_to_image'),
(12, 4, 'Гречка', 100, 'г', 'обід', 'вівторок', 105, 3.38, 0.62, 19.94, 'link_to_image'),
(13, 4, 'Котлети курячі', 100, 'г', 'обід', 'вівторок', 125, 18.72, 3.85, 3.35, 'link_to_image'),
(14, 4, 'Салат з огірків помідорів і сметаною', 100, 'г', 'обід', 'вівторок', 50, 1, 3, 3, 'link_to_image'),
(15, 4, 'Зелений чай без цукру', 250, 'мл', 'обід', 'вівторок', 1, 0, 0, 0.25, 'link_to_image'),
(16, 4, 'Тушковане філе с овочами', 100, 'г', 'вечеря', 'вівторок', 107, 15, 2.5, 4, 'link_to_image'),
(17, 4, 'Сік томатний', 250, 'мл', 'вечеря', 'вівторок', 21, 1, 0.1, 3.6, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (10, 2), -- діабет
    (17, 2); -- діабет

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(18, 4, 'Бутерброд з яйцем та сиром', 100, 'г', 'сніданок', 'середа', 233, 10.69, 13.3, 17.76, 'link_to_image'),
(19, 4, 'Зелений чай без цукру', 250, 'мл', 'сніданок', 'середа', 1, 0, 0, 0.25, 'link_to_image'),
(20, 4, 'Крупа Перлова', 100, 'г', 'обід', 'середа', 324, 9.3, 1.1, 73.7, 'link_to_image'),
(21, 4, 'Тушковані овочі', 100, 'г', 'обід', 'середа', 33, 1.3, 0.1, 5.6, 'link_to_image'),
(22, 4, 'Зелений чай без цукру', 250, 'мл', 'обід', 'середа', 1, 0, 0, 0.25, 'link_to_image'),
(23, 4, 'Хек запечений з овочами', 100, 'г', 'вечеря', 'середа', 96, 9.45, 4.84, 3.93, 'link_to_image'),
(24, 4, 'Кефір 2.5%', 250, 'мл', 'вечеря', 'середа', 50, 3, 2.5, 3.8, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (20, 2); -- діабет

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(25, 4, 'Омлет з молоком', 100, 'г', 'сніданок', 'четвер', 121, 9.2, 8.3, 2.3, 'link_to_image'),
(26, 4, 'Хліб цільнозерновий', 100, 'г', 'сніданок', 'четвер', 237, 13, 3.3, 41, 'link_to_image'),
(27, 4, 'Зелений чай без цукру', 250, 'мл', 'сніданок', 'четвер', 1, 0, 0, 0.25, 'link_to_image'),
(28, 4, 'Макарони з твердих сортів', 100, 'г', 'обід', 'четвер', 353, 11, 1.1, 74, 'link_to_image'),
(29, 4, 'Фарш з яловичини нежирний', 100, 'г', 'обід', 'четвер', 125, 20, 5, 0.5, 'link_to_image'),
(30, 4, 'Сік томатний', 250, 'мл', 'обід', 'четвер', 21, 1, 0.1, 3.6, 'link_to_image'),
(31, 4, 'М’ясо куряче варене', 100, 'г', 'вечеря', 'четвер', 204, 18, 18, 1, 'link_to_image'),
(32, 4, 'Капуста тушкована', 100, 'г', 'вечеря', 'четвер', 70, 1.73, 3.13, 4.91, 'link_to_image'),
(33, 4, 'Зелений чай без цукру', 250, 'мл', 'вечеря', 'четвер', 1, 0, 0, 0.25, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (28, 2); -- діабет

INSERT INTO `nutrition` (`id`,`training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(34, 4, 'Гречана каша з овочами', 100, 'г', 'сніданок', 'п’ятниця', 91, 6.2, 2.5, 11, 'link_to_image'),
(35, 4, 'Зелений чай без цукру', 250, 'мл', 'сніданок', 'п’ятниця', 1, 0, 0, 0.25, 'link_to_image'),
(36, 4, 'Овочеве рагу з м’ясом', 100, 'г', 'обід', 'п’ятниця', 97, 4.46, 4.23, 10.36, 'link_to_image'),
(37, 4, 'Кефір 2.5%', 250, 'мл', 'обід', 'п’ятниця', 50, 3, 2.5, 3.8, 'link_to_image'),
(38, 4, 'Cалат осінній з овочами та рибою', 100, 'г', 'вечеря', 'п’ятниця', 94, 3.73, 7.21, 3.52, 'link_to_image'),
(39, 4, 'Зелений чай без цукру', 250, 'мл', 'вечеря', 'п’ятниця', 1, 0, 0, 0.25, 'link_to_image');

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(40, 4, 'Яєчня на пару(без олії)', 100, 'г', 'сніданок', 'субота', 160, 12.7, 10.9, 0.7, 'link_to_image'),
(41, 4, 'Салат з яйцем і плавленим сиром', 100, 'г', 'сніданок', 'субота', 355, 17, 31.1, 1.6, 'link_to_image'),
(42, 4, 'Компот ягідний', 250, 'мл', 'сніданок', 'субота', 125, 0.25, 0.12, 30, 'link_to_image'),
(43, 4, 'Картопля запечена', 100, 'г', 'обід', 'субота', 185, 2.8, 9.5, 23.4, 'link_to_image'),
(44, 4, 'Салат Весняний', 100, 'г', 'обід', 'субота', 21, 0.8, 0.2, 3.2, 'link_to_image'),
(45, 4, 'Зелений чай без цукру', 250, 'мл', 'обід', 'субота', 1, 0, 0, 0.25, 'link_to_image'),
(46, 4, 'Запечена риба', 100, 'г', 'вечеря', 'субота', 103, 6.8, 4.7, 8.4, 'link_to_image'),
(47, 4, 'Запечені овочі', 100, 'г', 'вечеря', 'субота', 33, 1.17, 1.1, 5, 'link_to_image'),
(48, 4, 'Сік томатний', 250, 'мл', 'вечеря', 'субота', 21, 1, 0.1, 3.6, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (41, 2), -- діабет
    (42, 2), -- діабет
    (43, 2), -- діабет
    (48, 2); -- діабет

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(49, 4, 'Запіканка сирна', 100, 'г', 'сніданок', 'неділя', 176, 17.6, 4.2, 14.6, 'link_to_image'),
(50, 4, 'Зелений чай без цукру', 250, 'мл', 'сніданок', 'неділя', 1, 0, 0, 0.25, 'link_to_image'),
(51, 4, 'Суп овочевий', 100, 'г', 'обід', 'неділя', 37, 1.7, 1.6, 4.2, 'link_to_image'),
(52, 4, 'Варені яйця', 100, 'г', 'обід', 'неділя', 152, 13, 10.61, 1.12, 'link_to_image'),
(53, 4, 'Компот ягідний', 250, 'мл', 'обід', 'неділя', 125, 0.25, 0.12, 30, 'link_to_image'),
(54, 4, 'Філе куряче запечене з картоплею під сиром', 100, 'г', 'вечеря', 'неділя', 157, 11.5, 0.5, 8.9, 'link_to_image'),
(55, 4, 'Зелений чай без цукру', 250, 'мл', 'вечеря', 'неділя', 1, 0, 0, 0.25, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (49, 2), -- діабет
    (53, 2), -- діабет
    (54, 2); -- діабет
