USE FitNetDB;

# підвищення витривалості

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(189, 3, 'Ківі', 100, 'г', 'сніданок', 'понеділок', 71, 1, 0.63, 13.85, 'link_to_image'),
(190, 3, 'Рис з овочами', 100, 'г', 'сніданок', 'понеділок', 99, 1.6, 3.8, 15.1, 'link_to_image'),
(191, 3, 'Яйце куряче варене', 100, 'г', 'сніданок', 'понеділок', 152, 13, 10.61, 1.12, 'link_to_image'),
(192, 3, 'Зелений чай без цукру', 250, 'мл', 'сніданок', 'понеділок', 1, 0, 0, 0.25, 'link_to_image'),
(193, 3, 'Гречана каша', 100, 'г', 'обід', 'понеділок', 92, 3.4, 0.6, 19.9, 'link_to_image'),
(194, 3, 'Курка тушкована з овочами', 100, 'г', 'обід', 'понеділок', 115, 20, 3, 2, 'link_to_image'),
(195, 3, 'Печене яблуко без цукру', 100, 'г', 'обід', 'понеділок', 49, 0.4, 0.4, 9.8, 'link_to_image'),
(196, 3, 'Зелений чай без цукру', 250, 'мл', 'обід', 'понеділок', 1, 0, 0, 0.25, 'link_to_image'),
(197, 3, 'Запечена риба', 100, 'г', 'вечеря', 'понеділок', 103, 6.8, 4.7, 8.4, 'link_to_image'),
(198, 3, 'Салат з огірків помідорів і сметаною', 100, 'г', 'вечеря', 'понеділок', 50, 1, 3, 3, 'link_to_image'),
(199, 3, 'Зелений чай без цукру', 250, 'мл', 'вечеря', 'понеділок', 1, 0, 0, 0.25, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (189, 2), -- діабет
    (190, 2); -- діабет

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(200, 3, 'Омлет 2 яйця + 40мл молока', 100, 'г', 'сніданок', 'вівторок', 131, 10.1, 8.9, 1.8, 'link_to_image'),
(201, 3, 'Хліб цільнозерновий', 100, 'г', 'сніданок', 'вівторок', 237, 13, 3.3, 41, 'link_to_image'),
(202, 3, 'Сир твердий', 100, 'г', 'сніданок', 'вівторок', 347, 22.5, 28.5, 4.7, 'link_to_image'),
(203, 3, 'Салат з огірків помідорів і сметаною', 100, 'г', 'сніданок', 'вівторок', 50, 1, 3, 3, 'link_to_image'),
(204, 3, 'Зелений чай без цукру', 250, 'мл', 'сніданок', 'вівторок', 1, 0, 0, 0.25, 'link_to_image'),
(205, 3, 'Гречана каша', 100, 'г', 'обід', 'вівторок', 92, 3.4, 0.6, 19.9, 'link_to_image'),
(206, 3, 'Куряче філе запечене з травами', 100, 'г', 'обід', 'вівторок', 113, 23.9, 1.9, 0.4, 'link_to_image'),
(207, 3, 'Овочевий салат з фетою', 100, 'г', 'обід', 'вівторок', 70, 4.1, 4.4, 3.2, 'link_to_image'),
(208, 3, 'Кефір 1%', 250, 'мл', 'обід', 'вівторок', 93, 8, 2.5, 9.75, 'link_to_image'),
(209, 3, 'Хек запечений з овочами', 100, 'г', 'вечеря', 'вівторок', 96, 9.45, 4.84, 3.93, 'link_to_image'),
(210, 3, 'Рис', 100, 'г', 'вечеря', 'вівторок', 117, 2.9, 0.4, 25.2, 'link_to_image'),
(211, 3, 'Зелений чай без цукру', 250, 'мл', 'вечеря', 'вівторок', 1, 0, 0, 0.25, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (210, 2); -- діабет

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(212, 3, 'Бананові оладки', 100, 'г', 'сніданок', 'середа', 176, 5.4, 5.5, 27, 'link_to_image'),
(213, 3, 'Кефір 2.5%', 250, 'мл', 'сніданок', 'середа', 124, 7.5, 6.25, 9.5, 'link_to_image'),
(214, 3, 'Куряча грудка фарширована', 100, 'г', 'обід', 'середа', 340, 31, 16, 19, 'link_to_image'),
(215, 3, 'Гречка', 100, 'г', 'обід', 'середа', 105, 3.38, 0.62, 19.94, 'link_to_image'),
(216, 3, 'Салат з огірків помідорів і сметаною', 100, 'г', 'обід', 'середа', 50, 1, 3, 3, 'link_to_image'),
(217, 3, 'Зелений чай без цукру', 250, 'мл', 'обід', 'середа', 1, 0, 0, 0.25, 'link_to_image'),
(218, 3, 'Запіканка сирна', 100, 'г', 'вечеря', 'середа', 50, 17.6, 4.2, 14.6, 'link_to_image'),
(219, 3, 'Йогурт 1.6% білий густий без цукру', 250, 'мл', 'вечеря', 'середа', 122, 10, 4, 11.75, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (212, 2), -- діабет
    (218, 2); -- діабет

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(220, 3, 'Мюслі з молоком', 100, 'г', 'сніданок', 'четвер', 101, 3.5, 4.7, 11.2, 'link_to_image'),
(221, 3, 'Яйце куряче варене', 100, 'г', 'сніданок', 'четвер', 152, 13, 10.61, 1.12, 'link_to_image'),
(222, 3, 'Шинка нежирна', 100, 'г', 'сніданок', 'четвер', 91, 17, 2, 1, 'link_to_image'),
(223, 3, 'Зелений чай без цукру', 250, 'мл', 'сніданок', 'четвер', 1, 0, 0, 0.25, 'link_to_image'),
(224, 3, 'Філе куряче варене', 100, 'г', 'обід', 'четвер', 151, 29, 3, 0, 'link_to_image'),
(225, 3, 'Рис з овочами', 100, 'г', 'обід', 'четвер', 99, 1.6, 3.8, 15.1, 'link_to_image'),
(226, 3, 'Сік апельсиновий', 250, 'мл', 'обід', 'четвер', 128, 1.75, 0, 30, 'link_to_image'),
(227, 3, 'Картопля запечена з олією', 100, 'г', 'вечеря', 'четвер', 185, 2.8, 9.5, 23.4, 'link_to_image'),
(228, 3, 'Легкий овочевий салат', 100, 'г', 'вечеря', 'четвер', 88, 1, 7, 5, 'link_to_image'),
(229, 3, 'Зелений чай без цукру', 250, 'мл', 'вечеря', 'четвер', 1, 0, 0, 0.25, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (220, 2), -- діабет
    (225, 2), -- діабет
    (226, 2), -- діабет
    (227, 2); -- діабет

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(230, 3, 'Вівсяна каша', 100, 'г', 'сніданок', 'п’ятниця', 88, 3, 1.7, 15, 'link_to_image'),
(231, 3, 'Яйце куряче варене', 100, 'г', 'сніданок', 'п’ятниця', 152, 13, 10.61, 1.12, 'link_to_image'),
(232, 3, 'Зелений чай без цукру', 250, 'мл', 'сніданок', 'п’ятниця', 1, 0, 0, 0.25, 'link_to_image'),
(233, 3, 'Салат з морською капустою і яйцем', 100, 'г', 'сніданок', 'п’ятниця', 166, 10, 11, 6, 'link_to_image'),
(234, 3, 'Зелений чай без цукру', 250, 'мл', 'сніданок', 'п’ятниця', 1, 0, 0, 0.25, 'link_to_image'),
(235, 3, 'Котлета куряча парова', 100, 'г', 'вечеря', 'п’ятниця', 135, 21.5, 2, 4, 'link_to_image'),
(236, 3, 'Салат з помідорами і сиром фета', 100, 'г', 'вечеря', 'п’ятниця', 105, 4.1, 8.3, 3.5, 'link_to_image'),
(237, 3, 'Зелений чай без цукру', 250, 'мл', 'вечеря', 'п’ятниця', 1, 0, 0, 0.25, 'link_to_image');

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(238, 3, 'Рис з овочами', 100, 'г', 'сніданок', 'субота', 99, 1.6, 3.8, 15.1, 'link_to_image'),
(239, 3, 'Вода з лимоном', 250, 'мл', 'сніданок', 'субота', 4, 0, 0, 1, 'link_to_image'),
(240, 3, 'Риба тушкована в томаті з овочами', 100, 'г', 'обід', 'субота', 110, 14, 3.96, 7.1, 'link_to_image'),
(241, 3, 'Зелений чай без цукру', 250, 'мл', 'обід', 'субота', 1, 0, 0, 0.25, 'link_to_image'),
(242, 3, 'Картопляне пюре', 100, 'г', 'вечеря', 'субота', 115, 2.7, 2.75, 19.47, 'link_to_image'),
(243, 3, 'Котлети курячі рублені', 100, 'г', 'вечеря', 'субота', 125, 18.72, 3.85, 3.35, 'link_to_image'),
(244, 3, 'Зелений чай без цукру', 250, 'мл', 'вечеря', 'субота', 1, 0, 0, 0.25, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (238, 2); -- діабет

INSERT INTO `nutrition` (`id`, `training_type_id`, `name`, `product_mass`, `measurement`, `meals_time`, `day_nutrition`, `calories`, `proteins`, `fats`, `carbohydrates`, `image_link`) VALUES
(245, 3, 'Млинці з медом', 100, 'г', 'сніданок', 'неділя', 210, 4.3, 2.5, 42.2, 'link_to_image'),
(246, 3, 'Зелений чай без цукру', 250, 'мл', 'сніданок', 'неділя', 1, 0, 0, 0.25, 'link_to_image'),
(247, 3, 'Рагу овочеве з куркою', 100, 'г', 'обід', 'неділя', 85, 7, 4, 5, 'link_to_image'),
(248, 3, 'Зелений чай без цукру', 250, 'мл', 'обід', 'неділя', 1, 0, 0, 0.25, 'link_to_image'),
(249, 3, 'Запечена риба', 100, 'г', 'вечеря', 'неділя', 103, 6.8, 4.7, 8.4, 'link_to_image'),
(250, 3, 'Запечені овочі', 100, 'г', 'вечеря', 'неділя', 33, 1.17, 1.1, 5, 'link_to_image'),
(251, 3, 'Зелений чай без цукру', 250, 'мл', 'вечеря', 'неділя', 1, 0, 0, 0.25, 'link_to_image');

INSERT INTO `nutrition_diseases` (`nutrition_id`, `disease_id`)
VALUES 
    (245, 2); -- діабет